#1.计算并输出下面级数前20项的和
#1*2*3-2*3*4+3*4*5-4*5*6+5*6*7...
# s=0
# for i in range(1,21):
#     a=i*(i+1)*(i+2)
#     if i%2==0:
#         a=0-i*(i+1)*(i+2)
#     s=s+a
# print(s)

#up主的写法
# s=0
# n=1
# for i in range(1,21):
#     s=s+n*i*(i+1)*(i+2)
#     n=-n
# print("前20项的和：%d" %s)

#2.已知公式Π/4=1-1/3+1/5-1/7+...,根据前5000项来计算Π的近似取值
# s=0
# n=1
# for i in range(1,9999,2):
#     s=s+n*1/i
#     n=-n
# pai=s*4
# print("Π的近似值是",pai)

#另一种方法是用奇数项的和-偶数项的和
s1=0
s2=0
for i in range(1,5001):
    if i%2==0:
        s2=s2+1/(i*2-1)
    else:
        s1=s1+1/(i*2-1)
pai=(s1-s2)*4
print("Π的近似值：",pai)