#输出以下图形
#       *
#      ***
#     *****
#    *******
#   *********
#用i表示行，k表示要打印的空格，j表示*的数量
#一共5行，第一行4个空格，第二行3个空格，所以每行空格数是5-i,每行*数量是2*i-1
# for i in range(1,6):
#     for k in range(1,5-i+1):
#         print(" ",end=" ")
#     for j in range(1,2*i):
#         print("*",end=" ")
#     print()#一行输出完要换行

#方法二
# for i in range(1,6):
#     print(" "*(5-i),end=" ")
#     print("*"*(2*i-1),end=" ")
#     print()

#输出空心等腰三角形
#       *
#      * *
#     *   *
#    *     *
#   * * * * *
#一共5行，按行输出
#第2-4行，输出5-i个空格后，输出1个*，再输出2*i-3个空格，再输出1个*
#第5行，输出空格后，输出5个*+空格
for i in range(1,6,1):
    print(" "*(5-i),end="")#end=""引号里不要加空格,加空格会输出一个空格
    if i==1:
        print("*")
    # elif 2<=i<=4:
        print("*",end="")
        print(" "*(2*i-3),end="")
        print("*")
    else:
        print("* "*5)
